In [7]:
import pandas as pd
# example_connect.py
from sqlalchemy import create_engine
import os
import dotenv

In [11]:
dotenv.load_dotenv()  # Load environment variables from .env file
ZEEGUU_MYSQL_ROOT_PASSWORD = os.getenv("ZEEGUU_MYSQL_ROOT_PASSWORD")  # e.g. postgresql://user:pass@host:5432/db
ZEEGUU_MYSQL_DB = os.getenv("ZEEGUU_MYSQL_DB")  # e.g. postgresql://user:pass@host:5432/db
ZEEGUU_MYSQL_USER = os.getenv("ZEEGUU_MYSQL_USER")  # e.g. postgresql://user:pass@host:5432/db
ZEEGUU_MYSQL_USER_PASSWORD = os.getenv("ZEEGUU_MYSQL_USER_PASSWORD")  # e.g. postgresql://user:pass@host:5432/db

DB_URL = f"mysql+pymysql://{ZEEGUU_MYSQL_USER}:{ZEEGUU_MYSQL_USER_PASSWORD}@127.0.0.1:3306/{ZEEGUU_MYSQL_DB}"

# Users

In [ ]:
engine = create_engine(DB_URL, pool_size=10, max_overflow=20)

In [21]:
# small result
query = "SELECT * FROM user"

In [ ]:
df = pd.read_sql_query(query, engine)

In [32]:
total_users = len(df)
print(f"Total users: {total_users}")

Total users: 3970

In [26]:
print(df["daily_streak"].mean())

0.8191435768261964

In [ ]:
# Active users seen this year
active_users = df[df["last_seen"] > "2026-01-01"]
print(f"Active users: {len(active_users)}")

Active users: 483

# Users Activity

In [40]:
# small result
query = "SELECT * FROM user_activity_data"
df = pd.read_sql_query(query, engine)

In [42]:
df.head()

,id,user_id,time,event,value,article_id,source_id,extra_data,has_article_id,platform
0,10001,617,2017-05-19 15:36:36,UMR - DISABLE COPY,x,NaN,NaN,{},0.0,NaN
1,10050,617,2017-05-19 15:47:47,UMR - DISABLE COPY,,NaN,NaN,{},0.0,NaN
2,10075,602,2017-05-19 17:14:14,UMR - DISABLE COPY,,NaN,NaN,{},0.0,NaN
3,10147,602,2017-05-19 17:27:27,UMR - DISABLE COPY,,NaN,NaN,{},0.0,NaN
4,10149,602,2017-05-19 17:31:31,UMR - DISABLE COPY,,NaN,NaN,{},0.0,NaN

# Exercises

In [43]:
exercise_query = "SELECT * FROM exercise"
exercise_df = pd.read_sql_query(exercise_query, engine)

In [44]:
exercise_df.head()

,id,source_id,outcome_id,solving_speed,time,feedback,session_id,user_word_id
0,7989,4,3,8069,2017-06-08 14:10:06,NaN,NaN,9963
1,8863,4,3,15745,2017-06-10 10:03:19,NaN,NaN,9963
2,10641,7,4,8166,2017-06-13 18:55:51,NaN,NaN,14608
3,10642,7,13,11030,2017-06-13 18:55:54,NaN,NaN,14608
4,10928,5,4,7981,2017-06-13 21:55:00,NaN,NaN,7261

# user_exercise_session

In [46]:
exercise_query = "SELECT * FROM user_exercise_session"
exercise_df = pd.read_sql_query(exercise_query, engine)

In [47]:
exercise_df

,id,user_id,start_time,duration,last_action_time,is_active,platform
0,46876,4231,2023-10-13 07:01:19,19000,2023-10-13 07:01:19,0,NaN
1,46877,4231,2023-10-13 07:11:12,15000,2023-10-13 07:11:12,1,NaN
2,46879,4199,2023-10-13 07:18:20,52000,2023-10-13 07:18:20,0,NaN
3,46880,4199,2023-10-13 07:19:30,68000,2023-10-13 07:19:30,0,NaN
4,46882,2590,2023-10-13 07:31:41,74000,2023-10-13 07:31:41,1,NaN
...,...,...,...,...,...,...,...
14218,76056,4607,2026-02-16 10:22:55,0,2026-02-16 10:22:55,0,1.0
14219,76057,4607,2026-02-16 10:26:47,4000,2026-02-16 10:30:55,0,1.0
14220,76058,4607,2026-02-16 11:12:22,31000,2026-02-16 13:30:07,0,1.0
14221,76059,4607,2026-02-16 13:31:45,0,2026-02-16 13:31:45,0,1.0
14222,76060,4607,2026-02-16 13:38:05,1000,2026-02-16 13:38:06,0,1.0

# user_reading_session

In [49]:
readin_query = "SELECT * FROM user_reading_session"
reading_df = pd.read_sql_query(readin_query, engine)

In [50]:
reading_df

,id,user_id,article_id,start_time,duration,last_action_time,is_active,reading_source,platform
0,10692,676,45715.0,2018-03-02 12:08:05,392000,2018-03-02 12:14:37,0,NaN,NaN
1,10693,676,45715.0,2018-03-02 12:20:18,89000,2018-03-02 12:21:47,0,NaN,NaN
2,10694,676,47329.0,2018-03-02 12:22:13,143000,2018-03-02 12:24:36,0,NaN,NaN
3,10695,676,47329.0,2018-03-02 12:24:49,168000,2018-03-02 12:27:37,0,NaN,NaN
4,10696,676,47329.0,2018-03-02 12:27:50,163000,2018-03-02 12:30:33,0,NaN,NaN
...,...,...,...,...,...,...,...,...,...
86508,150122,6149,4249765.0,2026-02-16 07:58:41,18000,2026-02-16 10:41:29,1,web,1.0
86509,150123,6143,4249765.0,2026-02-16 08:00:55,160000,2026-02-16 08:11:04,1,web,2.0
86510,150124,6137,4249765.0,2026-02-16 08:06:54,107000,2026-02-16 08:10:16,1,web,1.0
86511,150125,5420,4249765.0,2026-02-16 11:01:43,22000,2026-02-16 11:07:12,1,web,1.0
86512,150127,5751,4268191.0,2026-02-16 11:22:26,116000,2026-02-16 11:55:28,1,web,1.0

# user_browsing_session

In [51]:
browsing_query = "SELECT * FROM user_browsing_session"
browsing_df = pd.read_sql_query(browsing_query, engine)

In [52]:
browsing_df

,id,user_id,start_time,duration,last_action_time,is_active,platform
0,1,4607,2025-12-11 10:10:31,25000,2025-12-11 10:45:10,1,NaN
1,2,4607,2025-12-11 10:48:16,0,2025-12-11 10:48:16,1,NaN
2,3,4607,2025-12-11 10:48:16,0,2025-12-11 10:48:16,1,NaN
3,4,5535,2025-12-11 11:36:34,0,2025-12-11 11:36:34,1,NaN
4,5,5535,2025-12-11 11:36:34,0,2025-12-11 11:36:34,1,NaN
...,...,...,...,...,...,...,...
7385,7668,6099,2026-02-16 12:06:18,10000,2026-02-16 12:47:31,1,1.0
7386,7669,6099,2026-02-16 13:00:32,0,2026-02-16 13:00:32,1,1.0
7387,7670,6099,2026-02-16 13:00:32,10000,2026-02-16 13:00:42,1,1.0
7388,7671,528,2026-02-16 13:04:01,0,2026-02-16 13:04:01,0,1.0
7389,7672,6099,2026-02-16 13:08:23,30000,2026-02-16 13:09:13,1,1.0